# პირველი დავალება
word = "apple"
print (word * 2)

# meore davaleba
# კომენტარი არის ტექსტი რომელსაც კომპიუტერი არ კითხულობს კოდის წაკითხვისას. 
# მისი გამოყენება კარგია რომ კოდები მარტივი გასაგები იყვეს ჩვენთვის 
# ასევე როცა გუნდურად ვმუშაობთ ეს აუცილებელია რომ ჩვენი კიდები სვებისთვის მარტივი და მალე გასაგები იყვეს

#მესამე დავალება
num1 = 5
num2 = 2.5
result = num1 * num2 
print(result ** 2)

#მეოთხე დავალება
name = "გიორგი"
surname = "ჩოხელი"
print("Hello, my name is " + name + " and my surname is " + surname )