# პირველი დავალება
# ფუნქცია არის კოდი, რომლსაც თავად დაარქმევ სახელს და თავად დაუწერ კოდს. 
# იგი შესაძლოა ნებისმიერ დროს გამოვიძახოთ
# შექმნისას ვიყენებთ def keyword-ს. მის შემდეგ ვწერთ ფუნქციის სახელს და მივუწერთ ფრჩხილებს. 
# შემდეგ ვწერთ ირწერტილს და ინდენტაციით ვწერთ კოდს.
# გამოძახებისას უნდა დავწეროთ ფუნქციის სახელი და მივუწეროთ ფრჩხილები.

# მეორე დავალება
def test():
    print("hello world!")
# არ გამოიტანს ტერმინალში არაფერს რადგან არ გამოგვიძახია
test()
test()
test()

# მესამე დავალება
def average():
    total = 0
    for i in range(5):
        num = int(input("enter number: "))
        total += num
    x = total / 5
    print(x)

#მეოთხე დავალება
def sayHi():
    print("გამარჯობა გიორგი")

x = sayHi()
print(x)
# none გამოიტანა, რადგან ფუნქციას შეუძლია ტექსტის დაბეჭდვა 
# ამიტომ აღარაა საჭირო მისი ცვლადში შენახვა და ისე გამოყენება