# პირველი დავალება
# data conversion - მონაცემის ერთი ტიპიდან მეორეში გადაყვანა.
# გვჭირდება როცა მონაცემის სხვა ტიპი გვინდა სასურველ ტიპს შევუსაბამოთ.

# მეორე დავალება
#

# string (str) - გადააქცევს ნებისმიერი ტიპის მონაცემს ტექსტურ მონაცემად, ანუ სტრინგად.
# str(15), str(hello world), str(19.4).

# integer (int) - გადააქცევს სხვა ტიპის მონაცემს (გარდა ტექსტისა) მთელ რიცხვად
# int(input), int(7.7), int(3.9).

# float - გადააქცევს სხვა ტიპის მონაცემს (გარდა ტექსტისა) ათწილად რიცხვად
# float(7), float("4"), float("5.6")

print(int("10") + 10)